[
  {
    "employer_name": "10x Genomics",
    "job_title": "Senior Software Validation Engineer, Manufacturing",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": "2w",
    "job_description": "• Utilize agentic AI and LLM’s to design and develop tools that increase process efficiency Computer System Validation (CSV): Lead and execute all activities related to the validation lifecycle of non-product software systems, ensuring compliance with internal procedures, ISO 13485 (future state), and relevant regulatory requirements.\n• Process Documentation: Author, review, and approve validation documentation, including Validation Plans (VP), User Requirements Specifications (URS), Functional Specifications (FS), Traceability Matrices (TM), Test Protocols (IQ/OQ/PQ), and Validation Reports (VR).\n• Technical Skills: Proficiency in writing automation scripts in Python and using software testing tools to drive efficient, repeatable testing.\n• Experience: 5 years of experience in Software Quality Assurance AND Computer System Validation (CSV) in a regulated, design-controlled industry (e.\n• Regulatory Knowledge: Demonstrated, in-depth understanding of ISO 13485 (or strong experience with an equivalent quality standard like FDA 21 CFR Part 820 or 21 CFR Part 11).\n• Current experience in an ISO 9001 environment is a plus.\n• Documentation Skills: Exceptional technical writing skills with the ability to create clear, concise, and compliant validation documentation.\n• Education: Bachelor's degree in Computer Science, Engineering or a related technical field.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837887185"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Senior Software Engineer",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": "2w",
    "job_description": "• Collaborate and Influence: You will work closely with application owners, enterprise architects, and other engineering teams to understand their needs and deliver integration solutions that empower them to move faster.\n• Bachelor's degree in Computer Science, Information Systems, or a related field.\n• Master's degree preferred.\n• 5 years of experience in software engineering with a focus on enterprise integrations or API development.\n• 3 years of experience designing and implementing AWS-based applications Software Engineering Mindset: A strong foundation in computer science, data structures, algorithms, and system design.\n• Proven Integration Experience: Demonstrated, hands-on experience building and operating complex integrations between large-scale applications.\n• Distributed Systems Knowledge: Experience with technologies and concepts core to modern integration, such as message queues (Kafka, RabbitMQ, Pub/Sub), event-driven architecture, and containerization (Docker, Kubernetes).\n• Experience with the APIs of major SaaS platforms like Salesforce, Workday, Oracle Fusion, or similar enterprise systems.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837888336"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "IT Support Engineer",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": null,
    "job_description": "• Exceptional Communication: Must be able to clearly articulate complex technical problems and solutions to both highly technical and non-technical users (verbal and written).\n• 3 years of hands-on IT Support/system administration experience 3 years supporting and provisioning Windows and macOS devices Experience supporting a large SaaS environment (Okta, Google Workspace, Zoom, Slack, Kandji, Intune, etc) Experience administering Okta, Zoom, and/or Google Workspace Experience with A/V support (ie.\n• Provide day to day technical support to users (onsite and remote), assisting them with their workstations, laptops, productivity software, and audio/visual systems.\n• Provide white-glove support for our executive leadership when necessary Provide A/V support for our conference rooms and webinars Manage incident lifecycle through our ticketing systems (Asana/ServiceNow), ensuring accurate documentation, timely communication, and adherence to SLAs.\n• Conduct hardware diagnostics, repair, and replacement for desktop computers, laptops, and peripherals.\n• Collaborate with other teams to provide technical and customer support Deploy, configure, and maintain standardized corporate images and software packages using MDM tools (Microsoft Intune, Kandji).\n• Develop and maintain clear, up-to-date documentation (Knowledge Base articles, process guides) for complex troubleshooting procedures.\n• Customer Focus and Empathy: Proven ability to remain patient, calm, and professional while assisting highly frustrated or anxious end-users.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837563467"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Sales Development Representative, West",
    "job_city": "US - Remote",
    "job_state": "",
    "job_posted_at": "3d",
    "job_description": "• Bachelor's degree in Biology, Molecular Biology, Biochemistry or related field.\n• Equivalent industry experience 0-1+ years experience in inside sales or business development roles.\n• Preferably in the academic, life sciences or biotechnology industries Adept at identifying ideal customer profiles and utilizing various research techniques to generate qualified leads Skilled at uncovering customer needs and pain points, effectively demonstrating how the company's products and services provide compelling solutions Proficiency in following established sales methodologies and navigating the sales cycle from initial contact to qualification and opportunity creation Proficiency in using CRM software and other sales tools for efficient lead management, activity tracking, and reporting Skilled at coordinating with internal teams to address customers queries in an outbound or inbound sales generation Outstanding relationship building, interpersonal and communication skills Proficient with Microsoft Word, Excel and Outlook and CRM database Fluency in English.\n• Account Executive, West Los AngelesCalifornia, USA (Remote)SalesPosted 2 months agoInside Sales - Sales Development RepresentativeJapan (Remote) + 1 moreSalesHybridPosted 18 days agoServices Sales Specialist, EastMassachusetts, USA (Remote)SalesPosted 12 days agoDirector of Commercial OperationsPleasanton, California, USA HQSalesPosted 4 months agoServices Sales Specialist, WestCalifornia, USA (Remote)SalesPosted 17 days agoSenior Director, Global Quality Pleasanton, California, USA HQOperationsPosted 2 months agoGlobal Commercial Education ManagerCalifornia, USA (Remote)SalesPosted 3 days agoSr.\n• Manager, Clinical BioinformaticsCalifornia, USA (Remote)Posted a month agoGlobal Commercial Education DeveloperCalifornia, USA (Remote)SalesPosted 3 days agoSr.\n• Maintaining strong collaboration with the Marketing team to leverage targeted campaigns and optimize lead flow Responsible for lead generation and qualification for all platforms – Chromium, Visium, and Xenium.\n• NGS Sales experience Experience of using SFDC Proven successful sales experience with a technical product line.\n• Ability to speak additional languages highly desirable.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171838096626"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Sr. Research Associate, Spatial Biology",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": null,
    "job_description": "• Basic coding skills Experience with image analysis using relevant SW (e.\n• CellProfiler, ImageJ) Familiarity with NGS library preparation workflows Light and fluorescent microscopy experience (confocal or standard epi-fluorescence) Knowledge and troubleshooting experience with liquid handling or automated systems (e.\n• Tecan, Hamilton) Work experience from similar positions in academia, industry or a service provider/core facility MSc, or equivalent, in Biomedical Sciences, Molecular Biology, Biochemistry, or a related field Experience with molecular biology techniques, including immunostaining and/or in situ hybridization techniques (e.\n• FISH, RNAscope, in situ hybridization) A proven track-record of using and optimizing and troubleshooting molecular biology protocols Tissue handling experience (fresh frozen, FFPE, cryosectioning, antigen retrieval, etc.\n• ) Strong organizational skills and ability to plan and structure your work Excellent interpersonal skills, including written and oral communication Ability to work in a fast-paced and quickly changing environment Production Associate (Contractor) (P-4908)Pleasanton, California, USA HQOperationsPosted 4 days agoAccount Executive, West Los AngelesCalifornia, USA (Remote)SalesPosted 2 months agoSenior Director, Global Quality Pleasanton, California, USA HQOperationsPosted 2 months agoDirector of Commercial OperationsPleasanton, California, USA HQSalesPosted 4 months agoSr.\n• Manager, Diagnostic Assay DevelopmentPleasanton, California, USA HQPosted a month agoDirector, CLIA LaboratoryPleasanton, California, USA HQPosted a month agoInside Sales - Sales Development RepresentativeJapan (Remote) + 1 moreSalesHybridPosted 18 days agoSenior Compliance Engineer (TEMP-Onsite)Pleasanton, California, USA HQPosted 4 days agoStaff Marketing Analytics ManagerPleasanton, California, USA HQMarketingPosted 2 months agoSenior Manager of SEC Reporting and Technical AccountingPleasanton, California, USA HQFinancePosted a month ago.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837544130"
  }
]