[
  {
    "employer_name": "10x Genomics",
    "job_title": "Sr. Scientist, Protein Engineering",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": null,
    "job_description": "• PhD or Masters in chemistry, biochemistry, computer science, physics or related fields with a minimum of 2 year’s post-graduate experience Experience with macromolecular modeling is required.\n• Experience in modeling protein:nucleic acid complexes is desired.\n• Experience with interfacing with, curating, and extracting information from sequence/protein databases is highly desired Strong data analysis skills.\n• Scripting in Python and/or R is strongly desired Demonstrated wet lab experience and design in molecular cloning, protein expression/purification, and developing/executing analytical and functional assays to rigorously test design hypotheses Demonstrated track record in using directed evolution or rational design to enhance function and solve complex biological problems, with a broad understanding of protein design applications in genomics is highly desired Excellent communication and organizational skills to manage multidisciplinary projects Desire to build game-changing technologies and impact the world of life science research Process ScientistSingapore OfficeOperationsPosted 3 months agoSr.\n• Proven proficiency in key computational tools, including AlphaFold (structure prediction), ProteinMPNN and RFdiffusion (inverse/de novo design), PyMOL and Foldseek (structural analysis).\n• Research Associate, Spatial BiologyPleasanton, California, USA HQPosted 9 days agoHistology Research Associate II - Part Time (TEMP)Pleasanton, California, USA HQPosted 15 hours agoSenior Director, Global Quality Pleasanton, California, USA HQOperationsPosted 25 days agoProduction Technician (Kitting) - Contractor (P-4877)Pleasanton, California, USA HQOperationsPosted 3 days agoDirector of Commercial OperationsPleasanton, California, USA HQSalesPosted 3 months agoSenior Software Engineer, Infrastructure EngineeringPleasanton, California, USA HQIT & Productivity EngineeringPosted 9 months agoStaff Software Engineer, Instrument Software Pleasanton, California, USA HQEngineering - SoftwarePosted 2 months agoStaff Marketing Analytics ManagerPleasanton, California, USA HQMarketingPosted a month agoStaff Mechanical Engineer, Precision Motion ControlPleasanton, California, USA HQEngineering - HardwarePosted 4 months ago Develop structural/computational biology workflows and/or machine learning methods to analyze existing, and design new, biomolecular structures Develop analytical and enzymatic assays to test your constructs and inform future development Apply Design of Experiments (DoE) principles to guide the optimization of enzyme reaction conditions Contribute to innovation and to building the company’s strong IP portfolio Collaborate with scientists and computational biologists working on multiple internal development projects across the product portfolio.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837219631"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Network Engineer",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": "1w",
    "job_description": "• Experience with network and routing protocols – Ethernet, TCP/IP, BGP, OSPF, IPsec VPN, Zero-trust model.\n• Experience with using protocol analysis tools such as wireshark.\n• Experience with network automation.\n• Experience building and managing networking elements within major cloud providers (AWS, MS Azure, GCP).\n• Experience building HA infrastructure by utilizing clustering, load balancing, and other technologies.\n• Working experience managing Palo Alto firewalls with Panorama and IAC.\n• Experience managing DNS, DHCP, and IPAM solutions from different vendors (Efficient IP, Cloudflare, MS DNS).\n• Experience in IP telephony and multi-campus video conferencing solutions.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837563465"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "IT Support Engineer",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": "1w",
    "job_description": "• Exceptional Communication: Must be able to clearly articulate complex technical problems and solutions to both highly technical and non-technical users (verbal and written).\n• 3 years of hands-on IT Support/system administration experience 3 years supporting and provisioning Windows and macOS devices Experience supporting a large SaaS environment (Okta, Google Workspace, Zoom, Slack, Kandji, Intune, etc) Experience administering Okta, Zoom, and/or Google Workspace Experience with A/V support (ie.\n• Provide day to day technical support to users (onsite and remote), assisting them with their workstations, laptops, productivity software, and audio/visual systems.\n• Provide white-glove support for our executive leadership when necessary Provide A/V support for our conference rooms and webinars Manage incident lifecycle through our ticketing systems (Asana/ServiceNow), ensuring accurate documentation, timely communication, and adherence to SLAs.\n• Conduct hardware diagnostics, repair, and replacement for desktop computers, laptops, and peripherals.\n• Collaborate with other teams to provide technical and customer support Deploy, configure, and maintain standardized corporate images and software packages using MDM tools (Microsoft Intune, Kandji).\n• Develop and maintain clear, up-to-date documentation (Knowledge Base articles, process guides) for complex troubleshooting procedures.\n• Customer Focus and Empathy: Proven ability to remain patient, calm, and professional while assisting highly frustrated or anxious end-users.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837563467"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Senior Director, Global Quality",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": "3w",
    "job_description": "• Bachelor’s degree or higher in a relevant scientific or engineering discipline (e.\n• 15+ years of progressive quality assurance leadership experience in Life Sciences, Diagnostics, or related industries, with proven success in consumables and instrumentation.\n• Experience leading organizations through ISO9001 and ISO13485 certification.\n• Exceptional leadership, organizational development, and communication skills, with a proven ability to influence across all levels of the business.\n• , Molecular Biology, Analytical Chemistry, Chemical Engineering or related engineering discipline).\n• Formal training and certification in Quality Assurance management (e.\n• Demonstrated success in establishing and managing effective QMS and Document Control systems in high-growth, complex organizations.\n• Deep understanding of Operations and R&D functions.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837343284"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Account Executive, West Los Angeles",
    "job_city": "US - Remote",
    "job_state": "",
    "job_posted_at": null,
    "job_description": "• Sales Management: Demonstrate funnel management skills with strong hunting/prospecting and closing skills.\n• Customer Relationships: Establish trust with customers, understand their research needs and internal dynamics, and take a consultative selling approach to provide the right solutions.\n• Team Coordination: Work effectively with sales and support teams, Collaboration: Work closely with other roles, aligning internal responsibilities and goals, and leveraging experts to drive customer decisions and an exceptional customer experience from awareness through adoption and utilization.\n• Post-Purchase Support: Manage the customer relationship post-purchase to support ongoing consumables use and identify new and future research opportunities and needs.\n• Market and Product Knowledge: Maintain current knowledge of genetic analysis markets, products, and buying practices required to effectively compete in the assigned territory.\n• Bachelor’s degree in Biology, Molecular Biology, Biochemistry or related field.\n• Or the equivalent knowledge and experience.\n• Minimum of 2 years sales experience in Life Science, selling small to mid-sized capital and consumables, preferably in the academic, life sciences or biotechnology industries Extensive knowledge of single cell and spatial biology tools applied to life science research.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837267294"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Finance Manager, Commercial FP&A",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": "18h",
    "job_description": "• BS / BA Degree in Finance or Accounting or equivalent experience (MBA is a plus).\n• 6+ years of experience in Finance.\n• Advanced Excel and PowerPoint skills required.\n• Knowledge of US Generally Accepted Accounting Principles (GAAP) as well as internal controls/Sarbanes-Oxley requirements.\n• Experience in data management and reporting, preferably supporting FP&A.\n• Strong verbal and written communications skills required.\n• Excellent analytical, problem solving, critical thinking, and organizational skills required.\n• Experience in the biotech or pharmaceutical industry and multinational organization is a plus.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837679203"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Production Technician (Kitting) - Contractor (P-4877)",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": "3d",
    "job_description": "• Execute production operations according to defined procedures and ensure the integrity and quality of our products Ability to operate and maintain laboratory to clean room standards required in the production of Life Science products Process work orders accurately using an ERP system in a timely manner Maintenance of production batch records and good documentation under ISO requirement Accurate tracking of production data, test data and inventory Assembly of 10x consumables and finished goods both manually and using semi-automated packaging equipment Ability to set up and operate packaging equipment and handle simple troubleshooting Perform preventive maintenance on some lab equipment Provide feedback to improve process quality and efficiency Identify issues occurring in production labs and escalate issues to supervisor’s or MSE’s attention High school education / Associate Degree or above Strong team player and detail oriented Good communication skills Ability to read and understand SOPs and equipment user manual Ability to enter data into electronic tracking systems like Excel Ability to multi-task and prioritize work load to meet strict deadlines under supervision Good documentation skills and ability to write procedures and reports Desire to be part of a rapidly evolving organization and taking products and processes to the next level Ability to lift up to 15 pounds and potentially stand or sit for up to 3 hour increments Experience in automation and packaging of Life Science products, Food Packaging products or related field preferred Relevant experience in a production environment working with standard production control tools – ERP, inventory control, and work orders Experience training employees on production processes defined in production batch records and work instructions Experience writing and revising work instructions and production batch records Experienced in communicating and collaborating with production departments Histology Research Associate II - Part Time (TEMP)Pleasanton, California, USA HQPosted 15 hours agoDirector of Commercial OperationsPleasanton, California, USA HQSalesPosted 3 months agoSenior Director, Global Quality Pleasanton, California, USA HQOperationsPosted 25 days agoProcess ScientistSingapore OfficeOperationsPosted 3 months agoSr.\n• Research Associate, Spatial BiologyPleasanton, California, USA HQPosted 9 days agoSenior Manufacturing Test Engineer (Contractor) (P-4758)Pleasanton, California, USA HQScientificPosted 3 months agoIT Support EngineerPleasanton, California, USA HQIT & Productivity EngineeringPosted 9 days agoNetwork EngineerPleasanton, California, USA HQIT & Productivity EngineeringPosted 9 days agoSenior NPI Engineer (P-4823)Singapore OfficeScientificPosted a month agoNPI Engineer 3 (P-4829)Singapore OfficeScientificPosted a month ago.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837631182"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Sales Development Representative, Southeast",
    "job_city": "US - Remote",
    "job_state": "",
    "job_posted_at": null,
    "job_description": "• Bachelor's degree in Biology, Molecular Biology, Biochemistry or related field.\n• Equivalent industry experience 0-1+ years experience in inside sales or business development roles.\n• Preferably in the academic, life sciences or biotechnology industries Adept at identifying ideal customer profiles and utilizing various research techniques to generate qualified leads Skilled at uncovering customer needs and pain points, effectively demonstrating how the company's products and services provide compelling solutions Proficiency in following established sales methodologies and navigating the sales cycle from initial contact to qualification and opportunity creation Proficiency in using CRM software and other sales tools for efficient lead management, activity tracking, and reporting Skilled at coordinating with internal teams to address customers queries in an outbound or inbound sales generation Outstanding relationship building, interpersonal and communication skills Proficient with Microsoft Word, Excel and Outlook and CRM database Fluency in English.\n• Maintaining strong collaboration with the Marketing team to leverage targeted campaigns and optimize lead flow Responsible for lead generation and qualification for all platforms – Chromium, Visium, and Xenium.\n• NGS Sales experience Experience of using SFDC Proven successful sales experience with a technical product line Account Executive, West Los AngelesCalifornia, USA (Remote)SalesPosted a month agoDirector of Commercial OperationsPleasanton, California, USA HQSalesPosted 3 months agoProcess ScientistSingapore OfficeOperationsPosted 3 months agoHistology Research Associate II - Part Time (TEMP)Pleasanton, California, USA HQPosted 15 hours agoSenior Director, Global Quality Pleasanton, California, USA HQOperationsPosted 25 days agoSr.\n• Ability to speak additional languages highly desirable.\n• Develop and execute independent lead generation strategies, utilizing research techniques to identify high-value prospects.\n• Track, report on, and participate in cross-functional initiatives aimed at driving revenue growth Foster strong working relationships and execute clear process flows for handoffs with cross-functional departments (e.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837264320"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Account Executive, West Los Angeles",
    "job_city": "US - Remote",
    "job_state": "",
    "job_posted_at": null,
    "job_description": "• Sales Management: Demonstrate funnel management skills with strong hunting/prospecting and closing skills.\n• Customer Relationships: Establish trust with customers, understand their research needs and internal dynamics, and take a consultative selling approach to provide the right solutions.\n• Team Coordination: Work effectively with sales and support teams, Collaboration: Work closely with other roles, aligning internal responsibilities and goals, and leveraging experts to drive customer decisions and an exceptional customer experience from awareness through adoption and utilization.\n• Post-Purchase Support: Manage the customer relationship post-purchase to support ongoing consumables use and identify new and future research opportunities and needs.\n• Market and Product Knowledge: Maintain current knowledge of genetic analysis markets, products, and buying practices required to effectively compete in the assigned territory.\n• Bachelor’s degree in Biology, Molecular Biology, Biochemistry or related field.\n• Or the equivalent knowledge and experience.\n• Minimum of 2 years sales experience in Life Science, selling small to mid-sized capital and consumables, preferably in the academic, life sciences or biotechnology industries Extensive knowledge of single cell and spatial biology tools applied to life science research.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837267294"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Sr. Scientist, Protein Engineering",
    "job_city": "Pleasanton",
    "job_state": "CA",
    "job_posted_at": null,
    "job_description": "• PhD or Masters in chemistry, biochemistry, computer science, physics or related fields with a minimum of 2 year’s post-graduate experience Experience with macromolecular modeling is required.\n• Experience in modeling protein:nucleic acid complexes is desired.\n• Experience with interfacing with, curating, and extracting information from sequence/protein databases is highly desired Strong data analysis skills.\n• Scripting in Python and/or R is strongly desired Demonstrated wet lab experience and design in molecular cloning, protein expression/purification, and developing/executing analytical and functional assays to rigorously test design hypotheses Demonstrated track record in using directed evolution or rational design to enhance function and solve complex biological problems, with a broad understanding of protein design applications in genomics is highly desired Excellent communication and organizational skills to manage multidisciplinary projects Desire to build game-changing technologies and impact the world of life science research Develop structural/computational biology workflows and/or machine learning methods to analyze existing, and design new, biomolecular structures Develop analytical and enzymatic assays to test your constructs and inform future development Apply Design of Experiments (DoE) principles to guide the optimization of enzyme reaction conditions Contribute to innovation and to building the company’s strong IP portfolio Collaborate with scientists and computational biologists working on multiple internal development projects across the product portfolio.\n• Proven proficiency in key computational tools, including AlphaFold (structure prediction), ProteinMPNN and RFdiffusion (inverse/de novo design), PyMOL and Foldseek (structural analysis).",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837219631"
  },
  {
    "employer_name": "10x Genomics",
    "job_title": "Senior NPI Engineer (P-4823)",
    "job_city": "Singapore Office",
    "job_state": "",
    "job_posted_at": null,
    "job_description": "• Create process requirements for both informing design activities, and to implement equipment and fixturing needed for process development and manufacturing efforts.\n• , travelers, bills-of-materials, Work Instructions, Lot History Records), and other Quality System requirements.\n• Design and development of manufacturing test fixtures as required.\n• Identify opportunities and implement changes to improve products and reduce costs by using knowledge of assembly methods, quality control standards, fabrication processes, tooling, production equipment, product design, and materials Support the transfer of product lines and the qualification-validation efforts Prepare reports and presentations summarizing information or trends related to manufacturing performance Provide technical expertise or support related to manufacturing.\n• Bachelor’s degree in Engineering: Mechanical, Electrical or Manufacturing with 5+ years of experience, or MS/ PhD with 4-5 years of experience.\n• Ability to review mechanical drawings, ability to read schematics Creation of pFMEAs, ECOs, work instructions, and qualification documentation.\n• Experienced in Supplier Engagement and support, domestic and offshore Working knowledge of, but not limited to, manufacturing and assembly techniques, machining, injection molding, instrument and consumables for biotech Experience working with instrument manufacturing under ISO 9001 or ISO 13485 standards.\n• Experience with SolidWorks, Oracle, Arena is a plus.",
    "job_apply_link": "https://careers.10xgenomics.com/careers/job/171837138149"
  }
]